app/Models/Modele.php

SELECT *
FROM `roles`
WHERE `id_role` = '1'
---
    public function getRoleParId($id)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('roles');
        $builder->where('id_role', $id);
        $query = $builder->get();

SELECT *
FROM `utilisateurs`
WHERE `email` = 'secretaire@getcet.fr'
---
    public function getUtilisateurParEmail($email)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('utilisateurs');
        $builder->where('email', $email);
        $query = $builder->get();

SELECT `utilisateurs`.*, `roles`.`libelle` as `role_libelle`
FROM `utilisateurs`
JOIN `roles` ON `roles`.`id_role` = `utilisateurs`.`id_role`
WHERE `id_utilisateur` = '4'
---
    public function getUtilisateurParId($id)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('utilisateurs');
        $builder->select('utilisateurs.*, roles.libelle as role_libelle');
        $builder->join('roles', 'roles.id_role = utilisateurs.id_role');
        $builder->where('id_utilisateur', $id);
        $query = $builder->get();

SELECT *
FROM `articles`
---
    public function getLesArticles()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('articles');
        $builder->select('*');
        $query = $builder->get();

SELECT `ventes`.*, `utilisateurs`.`nom` as `secretaire_nom`, `utilisateurs`.`prenom` as `secretaire_prenom`
FROM `ventes`
JOIN `utilisateurs` ON `utilisateurs`.`id_utilisateur` = `ventes`.`id_secretaire`
WHERE `ventes`.`etat` = 'en_cours'
ORDER BY `ventes`.`date_debut` DESC
---
    public function getLesVentes($etat = null)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('ventes');
        $builder->select('ventes.*, utilisateurs.nom as secretaire_nom, utilisateurs.prenom as secretaire_prenom');
        $builder->join('utilisateurs', 'utilisateurs.id_utilisateur = ventes.id_secretaire');
        if ($etat) {
            $builder->where('ventes.etat', $etat);
        }
        $builder->orderBy('ventes.date_debut', 'DESC');
        $query = $builder->get();

SELECT `ventes`.*, `utilisateurs`.`nom` as `secretaire_nom`, `utilisateurs`.`prenom` as `secretaire_prenom`
FROM `ventes`
JOIN `utilisateurs` ON `utilisateurs`.`id_utilisateur` = `ventes`.`id_secretaire`
WHERE `id_vente` = '2'
---
    public function getVenteParId($id)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('ventes');
        $builder->select('ventes.*, utilisateurs.nom as secretaire_nom, utilisateurs.prenom as secretaire_prenom');
        $builder->join('utilisateurs', 'utilisateurs.id_utilisateur = ventes.id_secretaire');
        $builder->where('id_vente', $id);
        $query = $builder->get();

SELECT *
FROM `inscriptions`
WHERE `id_vente` = '2'
AND `id_utilisateur` = '3'
---
    public function getInscritsVente($idVente)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('inscriptions');
        $builder->select('inscriptions.*, utilisateurs.nom, utilisateurs.prenom, utilisateurs.email');
        $builder->join('utilisateurs', 'utilisateurs.id_utilisateur = inscriptions.id_utilisateur');
        $builder->where('inscriptions.id_vente', $idVente);
        $query = $builder->get();